/*
*   ***************                       Задание №1                    ***********************
*
*   Вот смотрю на базу данных VK и не могу понять к чему придраться. Как всё работает я понимаю, но чувствую себя
*   как эскимос, которому доходчиво объяснили как кататься на водных лыжах, а потом спросили - что можно поменять
*   в конструкции лыж, чтобы катание на них было ещё более комфортным? Хотя больше пяти литров размороженной воды
*   он в жизни не видел.
*
*   Вопрос: А если user удалил свой профиль, его id становится мёртвым или назначается другому пользователю?
*
*   Я в Вконтакте только зарегестрирован, но появляюсь там раз в два года, поэтому могу что-то не предусмотреть.
*
*
*
*
*
*
*
*
*
*/
